The date was January 11, 1994, and it felt as cold as if an ice cube rested beneath the sole of your bare foot. On that wintery day at approximately 3:20 pm, something happened that was going to change everything. I was born. Now that 22 years have brought us to this day, how have things changed? I wonder what exactly constitutes a person making a change. There are billions of people in this world that don’t even know I exist, but somehow I feel at the center of it all. Some people would jump to call that narcissism. There’s a big chance by now that you believe this essay portrays a young man that lacks a sense of humility. I will not counter the possibility of that belief by telling you I am humble because that would be far too ironic. I do not believe this world revolves around me, nor do I hope it does. That would be selfish. I simply believe I was put on this earth for a purpose, and that there is always the possibility that my purpose could cross my path with every last person on this planet. I will also acknowledge how unlikely that possibility is, but I will not close the door on something that is less likely to occur. I have learned a lot in the 22 years that I have been alive, and I believe this essay will be the most brutally honest portrayal of Alec Milton. As I write to you, attempting to dig deep into my soul, I sit at a polished wooden desk in my dim lit room with the sound of rain pouring upon the roof above. The sound is a soothing one that is helping to guide me as I try to journey back to how I became the man I am today. Ultimately, it is a specific and unique set of experiences that have shaped me. When I was nine years old I was fortunate enough to go to summer camp in Maine at place called Camp Wekeela. I was scared young boy with a lot of pride, so you would never hear me admit how fearful I truly was to leave home for the summer. Being the youngest of four boys, it was time for the baby of the family to grow up. I spent the next seven summers of my life at Wekeela, each year returning home with two overweight duffle bags filled with new lesson, skills, and experiences. The school years grew longer as I grew older and the things became routine from September through May. My time at summer camp was quite the opposite. For any kid, summer camp is 2 months of rapid-fire life experiences coming at you from all angles. As far as I am concerned, the personal growth and independence that are gained from spending the summer away is an experience unparalleled for a child.I am certainly curious as to how many people use summer camp as an experience that has changed them, because I know well I am not the only one. I am going to tell you why my experience is different. I ever so modestly mentioned earlier that I felt I was put on this earth for a purpose. Currently I have a good idea of what that purpose it, even though I am still young. Ever since I was that young boy that set out for summer camp, there has been a consistency in me that has only grown over the years. I interact with almost everyone in my path. Furthermore, I have always felt this obligation to either engage or help anyone and everyone that I encounter. This obligation has had its good and bad moments.